;; ************************************************************************************
;; OneLocale_Demo-[en].lang
;; save this file as UTF-16 w/ BOM (Byte Order Mark)
;; • you may translate these user-interface values to the language of your choice
;;   (save with a new language tag)
;; ******************************************************
[General]
;; • 'Version' must match that of the main script
version     = 1.4
lang_id     = en
lang_name   = English
app_name    = OneLocale_Demo
description = OneLocale test & demo for AHKv2
translator  =
date        =
comment     =

;; EXTENDERS SECTION:
;; • Has a list of paths that 'extends' this file; if the requested Section
;;   or Key value is not found, it looks in the listed file(s)
;; • May be absolute or relative to this file
[:extenders:]
..\..\_lib\OneLocale_Dialog-template.lang
..\..\_lib\Versions-template.lang

;; TRANSLATORS:
;; • Keep veriables (%title%) unchanged.
;; • Any text to the right of '\z' is a comment to help you in translating.
;;   You may add to those comments if it helps other translators.
;; • Save with new name, with your language tag in the brackets.
;;   https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-lcid/a9eac961-e77d-41a6-90a5-ce1a8b0cdb9c
;; • Save as UTF-16 w/ BOM (Byte Order Mark) to preserve Unicode
;;   (a .lang file IS a type of .ini file)

;; Menus:
;; • Ampersand ('&') sets the Accesss Key
;;   • Choose the appropriate key for your language
;;   • Make them unique within a menu, if possible
;; • Tab ('\t') separates menu text and menu Accelerator
;;   • Choose the appropriate hotkey for your language
;;   • Make them unique within a GUI, if possible
[menu]
language    = &Language... \t Ctrl+L
file_test   = &Generate error message \t Ctrl+E
file_quit   = &Quit \t Ctrl+Q
help_read   = &View Readme in browser... \t F1
mnu_file    = &File
mnu_help    = &Help

;; GUI elements:
;; • Ampersand ('&') sets the Access Key
;;   • Choose the appropriate key for your language
;;   • Make them unique within a GUI, if possible
;; • Watch out for translated strings becoming too long to display propery; experiment.
;; • As a rule of thumb, messages should be no more than ~120% longer than base language.
[gui]
title       = %title% - version %ver% \z note, any text after '\z' is a comment to the translator.
ctlText1    = Enter today's date:
ctlChk1     = &Option 1
btn_Error   = &Test
btn_Help    = &Help
btn_Browse  = &Browse…
btn_Quit    = Quit

;; Tooltips:
;; • There are no access keys or accelerators.
;; • No length restriction - tooltips can grow to display a lot of text.
[tooltips]
ctlEdit1    = Here is a little more help on this entry.
ctlList1    = Choose a color from the list.
ctlChk1     = This option does nothing.
btn_Error   = Create a fake error message
btn_Help    = View the Readme file.
multiline   = Multiline test.
btn_Browse  = Browse for a file.

;; List contents:
;; • There are no hotkeys or accelerator keys
[list]
Red         = Red
Green       = Green
Blue        = Blue

;; Multiline text, without '=' on every line:
;; • Entire section should be translated
;; * Indent text with '\t'
;; * Add line breaks with '\n'
;; * Pay attention to display limits
[multiline]
→ Multiline text:
“Whoever battles monsters should see to it that
in the process he does not become a monster himself.
And when you look long into the abyss,
the abyss also looks into you.” \n—Nietzsche

[dialog_browse]
title  = Select a text file
filter = Text Files \z (*.txt, *.ahk)

;; • Language chooser dialog:
;; * This is a new Gui with its own access keys and accelerators.
;[dialog_lang]
;title       = Change Language
;lbl_lang    = User Interface Language:
;lbl_buttons = App will restart if you change Language \n (work in progress will be lost)
;btn_OK      = OK
;btn_Cancel  = Cancel

;; • Language chooser dialog
;[tooltips_dialog_lang]
;lang_list = Set User Interface Language

;; Error messages:
;; • Length doesn't have to be as limited (200-300% longer than base language is okay)
[errors]
bad_path                         = The file \n'%path%' \n could not be found.
;OneLocaleDlg_ini_write_error    = Could not write to configuration file\n %path%
;OneLocaleDlg_lang_not_found     = 'Language' entry in .INI file \n '%ini_path%' \n not found
;OneLocaleDlg_newname_not_found  = Unexpected error: Language file not found for '%newname%'.

